rinya101/SmartGarbageCart_Project_STM32/main.c
#include "stm32f4xx.h"
#include "SysClockConfig.h"
#include "FreeRTOS.h"
#include "task.h"
#include "bsp_usart.h"
#include <string.h>
#include "bsp_encoder.h"
#include "bsp_oled.h"
void app(void *pvParameters);
void led_init(void);

int main(void)
{
    /* 时钟配置 */
    SysClockConfig_HSE25MHZ();
    g_usart1_handle = pvPortMalloc(sizeof(usart_handle_t));
    if (g_usart1_handle == NULL)
    {
        while(1); // 内存不足
    }
    memset(g_usart1_handle, 0, sizeof(usart_handle_t));
    usart_cfg_t *cfg = pvPortMalloc(sizeof(usart_cfg_t));
    if (cfg == NULL)
    {
        while(1);// 内存不足
    }
    memset(cfg, 0, sizeof(cfg));
    *cfg = USART1_DEFAULT_CONFIG();
    bsp_usart_init(g_usart1_handle, *cfg);
    vPortFree(cfg);/* 释放内存 */
    /* 创建任务 */
    if(xTaskCreate(app, "app", 512, NULL, 5, NULL) != pdPASS)
    {
        printf("create task failed\r\n");
    }
    vTaskStartScheduler();
    while(1)
    {
        printf("[Error]: FreeRTOS scheduler error!\r\n");
    }
}

/**
 * @brief 用户任务
 */
void app(void *pvParameters)
{
    /* OLED POWER 初始化 VCC --> PB5 GND --> PB4 */
    GPIO_InitTypeDef GPIO_InitStruct;
    GPIO_InitStruct.GPIO_Pin    = GPIO_Pin_5 | GPIO_Pin_4;
    GPIO_InitStruct.GPIO_Mode   = GPIO_Mode_OUT;
    GPIO_InitStruct.GPIO_OType  = GPIO_OType_PP;
    GPIO_InitStruct.GPIO_PuPd   = GPIO_PuPd_NOPULL; 
    GPIO_InitStruct.GPIO_Speed  = GPIO_Speed_50MHz;
    GPIO_SetBits(GPIOB, GPIO_Pin_5);    /* VCC */
    GPIO_ResetBits(GPIOB, GPIO_Pin_4);  /* GND */
    GPIO_Init(GPIOB, &GPIO_InitStruct);
    /* OLED 初始化 */
    g_oled_handle = pvPortMalloc(sizeof(oled_handle_t));
    if (g_oled_handle == NULL) while(1);
    memset(g_oled_handle, 0, sizeof(oled_handle_t));
    bsp_oled_init(g_oled_handle, OLED_DEFAULT_CONFIG());
    for (int i = 0; i < 1024; i++)
    {
        g_oled_handle->screen_buf[i] = 0xAA;
    }
    bsp_oled_refresh(g_oled_handle);
    uint16_t count = 0;
    while(1)
    {
        for (int i = 0; i < 1024; i++)
        {
            g_oled_handle->screen_buf[i] = 0x00;
            bsp_oled_refresh(g_oled_handle);
            count++;
            printf("count = %d\n", count);
            vTaskDelay(5);
        }
        for (int i = 0; i < 1024; i++)
        {
            g_oled_handle->screen_buf[i] = 0xFF;
            bsp_oled_refresh(g_oled_handle);
            count--;
            printf("count = %d\n", count);
            vTaskDelay(5);
        }
        if (g_usart1_handle != NULL)
        {
            if (g_usart1_handle->new_msg_flag)
            {
                g_usart1_handle->new_msg_flag = 0;
                printf("usart Receive: %s\n",g_usart1_handle->rx_buf);
            }
        }
    }
}
void led_init(void)
{
    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);

    GPIO_InitTypeDef GPIO_InitStructure;
    GPIO_InitStructure.GPIO_Pin     = GPIO_Pin_13;
    GPIO_InitStructure.GPIO_Mode    = GPIO_Mode_OUT;
    GPIO_InitStructure.GPIO_OType   = GPIO_OType_PP;
    GPIO_InitStructure.GPIO_Speed   = GPIO_Speed_100MHz;
    GPIO_InitStructure.GPIO_PuPd    = GPIO_PuPd_NOPULL;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
}
